// Generated by jextract

package kernel.generated;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct FFI_ArrowArray {
 *     int64_t length;
 *     int64_t null_count;
 *     int64_t offset;
 *     int64_t n_buffers;
 *     int64_t n_children;
 *     const void **buffers;
 *     struct FFI_ArrowArray **children;
 *     struct FFI_ArrowArray *dictionary;
 *     void (*release)(struct FFI_ArrowArray *);
 *     void *private_data;
 * }
 * }
 */
public class FFI_ArrowArray {

    FFI_ArrowArray() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        delta_kernel_ffi_h.C_LONG_LONG.withName("length"),
        delta_kernel_ffi_h.C_LONG_LONG.withName("null_count"),
        delta_kernel_ffi_h.C_LONG_LONG.withName("offset"),
        delta_kernel_ffi_h.C_LONG_LONG.withName("n_buffers"),
        delta_kernel_ffi_h.C_LONG_LONG.withName("n_children"),
        delta_kernel_ffi_h.C_POINTER.withName("buffers"),
        delta_kernel_ffi_h.C_POINTER.withName("children"),
        delta_kernel_ffi_h.C_POINTER.withName("dictionary"),
        delta_kernel_ffi_h.C_POINTER.withName("release"),
        delta_kernel_ffi_h.C_POINTER.withName("private_data")
    ).withName("FFI_ArrowArray");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong length$LAYOUT = (OfLong)$LAYOUT.select(groupElement("length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t length
     * }
     */
    public static final OfLong length$layout() {
        return length$LAYOUT;
    }

    private static final long length$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t length
     * }
     */
    public static final long length$offset() {
        return length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t length
     * }
     */
    public static long length(MemorySegment struct) {
        return struct.get(length$LAYOUT, length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t length
     * }
     */
    public static void length(MemorySegment struct, long fieldValue) {
        struct.set(length$LAYOUT, length$OFFSET, fieldValue);
    }

    private static final OfLong null_count$LAYOUT = (OfLong)$LAYOUT.select(groupElement("null_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t null_count
     * }
     */
    public static final OfLong null_count$layout() {
        return null_count$LAYOUT;
    }

    private static final long null_count$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t null_count
     * }
     */
    public static final long null_count$offset() {
        return null_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t null_count
     * }
     */
    public static long null_count(MemorySegment struct) {
        return struct.get(null_count$LAYOUT, null_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t null_count
     * }
     */
    public static void null_count(MemorySegment struct, long fieldValue) {
        struct.set(null_count$LAYOUT, null_count$OFFSET, fieldValue);
    }

    private static final OfLong offset$LAYOUT = (OfLong)$LAYOUT.select(groupElement("offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t offset
     * }
     */
    public static final OfLong offset$layout() {
        return offset$LAYOUT;
    }

    private static final long offset$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t offset
     * }
     */
    public static final long offset$offset() {
        return offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t offset
     * }
     */
    public static long offset(MemorySegment struct) {
        return struct.get(offset$LAYOUT, offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t offset
     * }
     */
    public static void offset(MemorySegment struct, long fieldValue) {
        struct.set(offset$LAYOUT, offset$OFFSET, fieldValue);
    }

    private static final OfLong n_buffers$LAYOUT = (OfLong)$LAYOUT.select(groupElement("n_buffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t n_buffers
     * }
     */
    public static final OfLong n_buffers$layout() {
        return n_buffers$LAYOUT;
    }

    private static final long n_buffers$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t n_buffers
     * }
     */
    public static final long n_buffers$offset() {
        return n_buffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t n_buffers
     * }
     */
    public static long n_buffers(MemorySegment struct) {
        return struct.get(n_buffers$LAYOUT, n_buffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t n_buffers
     * }
     */
    public static void n_buffers(MemorySegment struct, long fieldValue) {
        struct.set(n_buffers$LAYOUT, n_buffers$OFFSET, fieldValue);
    }

    private static final OfLong n_children$LAYOUT = (OfLong)$LAYOUT.select(groupElement("n_children"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t n_children
     * }
     */
    public static final OfLong n_children$layout() {
        return n_children$LAYOUT;
    }

    private static final long n_children$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t n_children
     * }
     */
    public static final long n_children$offset() {
        return n_children$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t n_children
     * }
     */
    public static long n_children(MemorySegment struct) {
        return struct.get(n_children$LAYOUT, n_children$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t n_children
     * }
     */
    public static void n_children(MemorySegment struct, long fieldValue) {
        struct.set(n_children$LAYOUT, n_children$OFFSET, fieldValue);
    }

    private static final AddressLayout buffers$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("buffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void **buffers
     * }
     */
    public static final AddressLayout buffers$layout() {
        return buffers$LAYOUT;
    }

    private static final long buffers$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void **buffers
     * }
     */
    public static final long buffers$offset() {
        return buffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void **buffers
     * }
     */
    public static MemorySegment buffers(MemorySegment struct) {
        return struct.get(buffers$LAYOUT, buffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void **buffers
     * }
     */
    public static void buffers(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(buffers$LAYOUT, buffers$OFFSET, fieldValue);
    }

    private static final AddressLayout children$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("children"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray **children
     * }
     */
    public static final AddressLayout children$layout() {
        return children$LAYOUT;
    }

    private static final long children$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray **children
     * }
     */
    public static final long children$offset() {
        return children$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray **children
     * }
     */
    public static MemorySegment children(MemorySegment struct) {
        return struct.get(children$LAYOUT, children$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray **children
     * }
     */
    public static void children(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(children$LAYOUT, children$OFFSET, fieldValue);
    }

    private static final AddressLayout dictionary$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("dictionary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray *dictionary
     * }
     */
    public static final AddressLayout dictionary$layout() {
        return dictionary$LAYOUT;
    }

    private static final long dictionary$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray *dictionary
     * }
     */
    public static final long dictionary$offset() {
        return dictionary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray *dictionary
     * }
     */
    public static MemorySegment dictionary(MemorySegment struct) {
        return struct.get(dictionary$LAYOUT, dictionary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct FFI_ArrowArray *dictionary
     * }
     */
    public static void dictionary(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(dictionary$LAYOUT, dictionary$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * void (*release)(struct FFI_ArrowArray *)
     * }
     */
    public static class release {

        release() {
            // Should not be called directly
        }

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            void apply(MemorySegment _x0);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.ofVoid(
            delta_kernel_ffi_h.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = delta_kernel_ffi_h.upcallHandle(release.Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(release.Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static void invoke(MemorySegment funcPtr,MemorySegment _x0) {
            try {
                 DOWN$MH.invokeExact(funcPtr, _x0);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout release$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("release"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void (*release)(struct FFI_ArrowArray *)
     * }
     */
    public static final AddressLayout release$layout() {
        return release$LAYOUT;
    }

    private static final long release$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void (*release)(struct FFI_ArrowArray *)
     * }
     */
    public static final long release$offset() {
        return release$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void (*release)(struct FFI_ArrowArray *)
     * }
     */
    public static MemorySegment release(MemorySegment struct) {
        return struct.get(release$LAYOUT, release$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void (*release)(struct FFI_ArrowArray *)
     * }
     */
    public static void release(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(release$LAYOUT, release$OFFSET, fieldValue);
    }

    private static final AddressLayout private_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("private_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static final AddressLayout private_data$layout() {
        return private_data$LAYOUT;
    }

    private static final long private_data$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static final long private_data$offset() {
        return private_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static MemorySegment private_data(MemorySegment struct) {
        return struct.get(private_data$LAYOUT, private_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static void private_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(private_data$LAYOUT, private_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

